==================
Integer literal
==================
1
---
(source_file (expression (number (int_literal))))

==================
Float literal
==================
1.0
---
(source_file (expression (number (float_literal))))

==================
Long int
==================
1_000_000_000
---
(source_file (expression (number (int_literal))))

==================
Long float
==================
1_000_000_000.000_000
---
(source_file (expression (number (float_literal))))

==================
Hex / Color
==================
#FF0000AA
---
(source_file (expression (color)))

==================
Hex / Color Mixed case
==================
#ff00aa
---
(source_file (expression (color)))
